sdaiGetUpperBound(Sdai_Id_aggr*)
\details
Retrieves the upper bound of a specified aggregate element.
\param aggregate [in] An aggregate to get the upper bound from.
\returns An SDAI integer value that represents the upper bound value.